In [1]:
# Task ; Question 1

In [2]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
import warnings

In [3]:
warnings.filterwarnings("ignore")
from sklearn.metrics import confusion_matrix, ConfusionMatrixDisplay
data_set_name=sns.get_dataset_names()

In [4]:
print(data_set_name)

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [5]:
df=sns.load_dataset("titanic")

In [6]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [9]:
df["sex"].value_counts(normalize=True)

sex
male      0.647587
female    0.352413
Name: proportion, dtype: float64

In [10]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [11]:
df["deck"].value_counts(normalize=True)

deck
C    0.290640
B    0.231527
D    0.162562
E    0.157635
A    0.073892
F    0.064039
G    0.019704
Name: proportion, dtype: float64

In [12]:
df.drop(["deck"], axis=1)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [13]:
df1=df.drop(["embarked","class","who","adult_male","deck","embark_town","alone"],axis=1)

In [14]:
df1["sex"].mode()[0]

'male'

In [15]:
df1["age"].mode()

0    24.0
Name: age, dtype: float64

In [16]:
df1["age"].mean()

29.69911764705882

In [17]:
df1.loc[:,"sex"].mode()

0    male
Name: sex, dtype: object

In [18]:
df1.min()

survived         0
pclass           1
sex         female
age           0.42
sibsp            0
parch            0
fare           0.0
alive           no
dtype: object

In [19]:
bool_series = pd.notnull(df1["sex"])

In [20]:
df1

     survived  pclass     sex   age  sibsp  parch     fare alive
0           0       3    male  22.0      1      0   7.2500    no
1           1       1  female  38.0      1      0  71.2833   yes
2           1       3  female  26.0      0      0   7.9250   yes
3           1       1  female  35.0      1      0  53.1000   yes
4           0       3    male  35.0      0      0   8.0500    no
..        ...     ...     ...   ...    ...    ...      ...   ...
886         0       2    male  27.0      0      0  13.0000    no
887         1       1  female  19.0      0      0  30.0000   yes
888         0       3  female   NaN      1      2  23.4500    no
889         1       1    male  26.0      0      0  30.0000   yes
890         0       3    male  32.0      0      0   7.7500    no

[891 rows x 8 columns]

In [21]:
df1.fillna(df1["age"].mean(), inplace=True)

In [22]:
# Task ; Question 2.1

In [23]:
input="a4b4c4d1"
output=""

In [24]:
for i in range(0,len(input),2):
    char=input[i]
    count=int(input[i+1])
    output += char * count

In [25]:
print(output)

aaaabbbbccccd

In [26]:
# Task ; Question 2.2

In [27]:
input="a3b4c4d1"
output=""

In [28]:
for i in range(0,len(input),2):
    char=input[i]
    count=int(input[i+1])
    output += char * count
print(output)

aaabbbbccccd

In [58]:
# Task ; Question 3

In [60]:
 #frequency of elements in list

In [2]:
test_list = [[3, 5, 4],
             [6, 2, 4],
             [1, 3, 6]]
dic = {}

for sublist in test_list:
    for element in sublist:
        if element in dic:
            dic[element] += 1
        else :
            dic[element] = 1   

print("The Orignal list:",test_list)
print("list frequency of element is ",dic)

The Orignal list: [[3, 5, 4], [6, 2, 4], [1, 3, 6]]
list frequency of element is  {3: 2, 5: 1, 4: 2, 6: 2, 2: 1, 1: 1}

# Task ; Question 4

In [38]:
list1 = [1,2,3,4,5]
list2 = [4,5,3,7,8]
op=[]
for i in list1:
    if i in list2:
        op.append(i)
print(op)

[3, 4, 5]

In [40]:
# Task ; Question 5

In [62]:
list = ['Sohan', 'Mohan', 'Rohan']
output=[]

for i in list:
   output.append(i[0])
        
print(output)

['S', 'M', 'R']

In [64]:
# Task ; Question 6

In [82]:
list=['pandas', 'numpy','flask', 'python', 'python']
output=[]

for item in list:
    if list.count(item)>1 and item not in output:
        output.append(item)

for i in output:
    print(i)

python

In [84]:
# Task ; Question 7

In [112]:
my_string="santosh kawade"
if i in my_string:
    output=len(my_string)
print(f"count for the string is {output}")    
# or

print("Count for the string is",len(my_string))

count for the string is 14
Count for the string is 14

In [104]:
# Task ; Question 8

In [110]:
list=[1,2,5,3,4,8,9,"lis","a"]

if i in list:
    print("count for the list is ",len(list))

count for the list is  9